In [3]:
import numpy as np
import pandas as pd

In [4]:
train=pd.read_csv("train.csv")
test=pd.read_csv("test.csv")

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

**filling the missing values**

In [8]:
train.Age=train.Age.fillna(train.Age.median())
test.Age=test.Age.fillna(test.Age.median())

In [9]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
train.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [11]:
train.Embarked=train.Embarked.fillna('S')
test.Fare=test.Fare.fillna(train.Fare.median())

In [12]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [13]:
train.groupby("Embarked").Survived.value_counts()

Embarked  Survived
C         1            93
          0            75
Q         0            47
          1            30
S         0           427
          1           219
Name: Survived, dtype: int64

In [14]:
train.Sex=train.Sex.replace(['male','female'],[0,1])
train.Embarked=train.Embarked.replace(['C','S','Q'],[0,1,2])

test.Sex=test.Sex.replace(['male','female'],[0,1])
test.Embarked=test.Embarked.replace(['C','S','Q'],[0,1,2])

In [15]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,1
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,1

In [16]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,2
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,1
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,2
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,1

In [17]:
train.groupby("SibSp").Survived.value_counts()

SibSp  Survived
0      0           398
       1           210
1      1           112
       0            97
2      0            15
       1            13
3      0            12
       1             4
4      0            15
       1             3
5      0             5
8      0             7
Name: Survived, dtype: int64

In [18]:
train.groupby("Parch").Survived.value_counts()

Parch  Survived
0      0           445
       1           233
1      1            65
       0            53
2      0            40
       1            40
3      1             3
       0             2
4      0             4
5      0             4
       1             1
6      0             1
Name: Survived, dtype: int64

In [19]:
train_df_passenger=train["PassengerId"]
test_df_passenger=test["PassengerId"]

taking the age in parts. It will increase the accuracy.

In [20]:
train.loc[ train['Age'] <= 16, 'Age'] = 0
train.loc[(train['Age'] > 16) & (train['Age'] <= 32), 'Age'] = 1
train.loc[(train['Age'] > 32) & (train['Age'] <= 48), 'Age'] = 2
train.loc[(train['Age'] > 48) & (train['Age'] <= 64), 'Age'] = 3
train.loc[ train['Age'] > 64, 'Age'] = 4  


test.loc[ test['Age'] <= 16, 'Age'] = 0
test.loc[(test['Age'] > 16) & (test['Age'] <= 32), 'Age'] = 1
test.loc[(test['Age'] > 32) & (test['Age'] <= 48), 'Age'] = 2
test.loc[(test['Age'] > 48) & (test['Age'] <= 64), 'Age'] = 3
test.loc[ test['Age'] > 64, 'Age'] = 4

In [21]:
del train['PassengerId']
del train['Name']
del train['Cabin']
del train['Ticket']
del train['Fare']

del test['PassengerId']
del test['Name']
del test['Cabin']
del test['Ticket']
del test['Fare']
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0         0       3    0  1.0      1      0         1
1         1       1    1  2.0      1      0         0
2         1       3    1  1.0      0      0         1
3         1       1    1  2.0      1      0         1
4         0       3    0  2.0      0      0         1

In [22]:
train["Age"]=pd.Series(train["Age"],dtype=int)
test["Age"]=pd.Series(test["Age"],dtype=int)
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0         0       3    0    1      1      0         1
1         1       1    1    2      1      0         0
2         1       3    1    1      0      0         1
3         1       1    1    2      1      0         1
4         0       3    0    2      0      0         1

In [23]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier

# Sibsp and Parch

In [24]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0         0       3    0    1      1      0         1
1         1       1    1    2      1      0         0
2         1       3    1    1      0      0         1
3         1       1    1    2      1      0         1
4         0       3    0    2      0      0         1

In [25]:
test.head()

   Pclass  Sex  Age  SibSp  Parch  Embarked
0       3    0    2      0      0         2
1       3    1    2      1      0         1
2       2    0    3      0      0         2
3       3    0    1      0      0         1
4       3    1    1      1      1         1

Consider Parents Children(Parch) & Sibling Spouse (SibSp) as Family. Adding this will give Family.

In [26]:
train.groupby('SibSp').Survived.value_counts()

SibSp  Survived
0      0           398
       1           210
1      1           112
       0            97
2      0            15
       1            13
3      0            12
       1             4
4      0            15
       1             3
5      0             5
8      0             7
Name: Survived, dtype: int64

In [27]:
train.groupby('Parch').Survived.value_counts()

Parch  Survived
0      0           445
       1           233
1      1            65
       0            53
2      0            40
       1            40
3      1             3
       0             2
4      0             4
5      0             4
       1             1
6      0             1
Name: Survived, dtype: int64

In [28]:
train['Family']=train['SibSp']+train['Parch']

In [29]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked  Family
0         0       3    0    1      1      0         1       1
1         1       1    1    2      1      0         0       1
2         1       3    1    1      0      0         1       0
3         1       1    1    2      1      0         1       1
4         0       3    0    2      0      0         1       0

In [30]:
test['Family']=test['SibSp']+test['Parch']
test.head()

   Pclass  Sex  Age  SibSp  Parch  Embarked  Family
0       3    0    2      0      0         2       0
1       3    1    2      1      0         1       1
2       2    0    3      0      0         2       0
3       3    0    1      0      0         1       0
4       3    1    1      1      1         1       2

In [31]:
train.groupby('Family').Survived.value_counts()

Family  Survived
0       0           374
        1           163
1       1            89
        0            72
2       1            59
        0            43
3       1            21
        0             8
4       0            12
        1             3
5       0            19
        1             3
6       0             8
        1             4
7       0             6
10      0             7
Name: Survived, dtype: int64

In [32]:
train.loc[train['Family']>0,'Family']=1

In [33]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked  Family
0         0       3    0    1      1      0         1       1
1         1       1    1    2      1      0         0       1
2         1       3    1    1      0      0         1       0
3         1       1    1    2      1      0         1       1
4         0       3    0    2      0      0         1       0

In [34]:
test.loc[test['Family']>0 ,'Family']=1

In [35]:
test.head()

   Pclass  Sex  Age  SibSp  Parch  Embarked  Family
0       3    0    2      0      0         2       0
1       3    1    2      1      0         1       1
2       2    0    3      0      0         2       0
3       3    0    1      0      0         1       0
4       3    1    1      1      1         1       1

In [36]:
y_train=np.array(train['Survived'])
del train['Survived']

In [37]:
train.head()

   Pclass  Sex  Age  SibSp  Parch  Embarked  Family
0       3    0    1      1      0         1       1
1       1    1    2      1      0         0       1
2       3    1    1      0      0         1       0
3       1    1    2      1      0         1       1
4       3    0    2      0      0         1       0

In [38]:
del train['SibSp']
del test['SibSp']

del train['Parch']
del test['Parch']

In [39]:
train.head()

   Pclass  Sex  Age  Embarked  Family
0       3    0    1         1       1
1       1    1    2         0       1
2       3    1    1         1       0
3       1    1    2         1       1
4       3    0    2         1       0

In [40]:
X_train=np.array(train)
X_train.shape

(891, 5)

In [41]:
lr=LogisticRegression()
lr.fit(X_train,y_train)
k=lr.score(X_train,y_train)
print(k)

0.792368125701

In [42]:
dt=DecisionTreeClassifier()
dt.fit(X_train,y_train)
k1=dt.score(X_train,y_train)
print(k1)

0.830527497194

In [43]:
X_test=np.array(test)
print(X_test.shape)

(418, 5)

In [44]:
y_predict_lr=pd.Series(lr.predict(X_test))
y_predict_dt=pd.Series(dt.predict(X_test))

In [45]:
lr_ans=pd.DataFrame({
    "PassengerId":test_df_passenger,
    "Survived": y_predict_lr
})
dt_ans=pd.DataFrame({
    "PassengerId":test_df_passenger,
    "Survived":y_predict_dt
})

In [46]:
lr_ans.to_csv("predict_lr.csv",index=False)                 # got 75.119 % 
dt_ans.to_csv("predict_dt.csv",index=False)                # getting accuracy of 77.033 (present 78.947 )

Before adding the family feature i got 77.990 (which is given in titanic2 notebook)


after adding the family feature i got 78.947

In [47]:
from sklearn.ensemble import RandomForestClassifier

In [48]:
rf=RandomForestClassifier()
rf.fit(X_train,y_train)
k2=rf.score(X_train,y_train)
print(k2)

0.828282828283

In [49]:
y_predict_rf=pd.Series(rf.predict(X_test))

In [50]:
rf_ans=pd.DataFrame({
    "PassengerId":test_df_passenger,
    "Survived":y_predict_rf
})

In [51]:
rf_ans.to_csv("predict_rf.csv",index=False)